espressif/esp-idf/examples/bluetooth/nimble/power_save/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# Bluetooth Low Power Config
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_LE_LP_CLK_SRC_DEFAULT=y


CONFIG_ESP_MODEM_CLOCK_ENABLE_CHECKING=y

#
# Sleep Config
#
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_ESP_PHY_HW_SWITCH_RF=y

# end of Sleep Config

#
# RTC Clock Config
#
CONFIG_RTC_CLK_SRC_EXT_CRYS=y
# end of RTC Clock Config
